number = int(input('Введите число (от 3 до 20): '))
while number not in range(3, 21):   # проверка на ввод числа из условий задачи, но это не обязательно
    number = int(input('Некорректное число. Повторите ввод: '))
    continue
password = []   # создаем пустой список
for i in range(1, number): # перебираем числа в диапазоне от 1 до текущего числа (не включая) для поиска первого числа пары
    for j in range(i, number): # перебираем числа в диапазоне от i-го до текущего числа (не включая) для поиска второго числа пары
        if number % (i + j) == 0 and i != j: # проверяем на кратность и исключаем пары, где числа равны
            password.append(i) #  при выполнении условий добавляем первое число пары в список
            password.append(j) #  при выполнении условий добавляем первое число пары в список
password = int(''.join(map(str, password))) # преобразовываем список в число (пароль)
print(f'Ключ: {number} \nПароль: {password}')

'''
Все пароли для чисел от 3 до 20 (для сверки):
3 - 12
4 - 13
5 - 1423
6 - 121524
7 - 162534
8 - 13172635
9 - 1218273645
10 - 141923283746
11 - 11029384756
12 - 12131511124210394857
13 - 112211310495867
14 - 1611325212343114105968
15 - 1214114232133124115106978
16 - 1317115262143531341251161079
17 - 11621531441351261171089
18 - 12151811724272163631545414513612711810
19 - 118217316415514613712811910
20 - 13141911923282183731746416515614713812911
'''