# Исходные данные:
my_list = [42, 69, 322, 13, 0, 99, -5, 9, 8, 7, -6, 5]

# Решение:
index = 0                       # начальный индекс списка
while index < len(my_list):     # условие работы цикла: перебираем список до его конечного индекса
    if my_list[index] > 0:      # проверка является ли число положительным
        print(my_list[index])   # если положительное - выводим в консоль
        index = index + 1       # и переходим к следующему индексу в списке
        continue                # запускаем цикл заново
    if my_list[index] == 0:     # если ноль, то
        index = index + 1       # просто переходим к следующему индексу в списке, ничего не отображая в консоли
        continue                # запускаем цикл заново
    else:                       # если оба условия не выполнятся, то
        break                   # завершаем цикл